/*global kakao */
import React, { useEffect } from "react";

function Map() {
  let positions = [
    {
      title: "강남구1",
      lat: 37.4823041565813,
      lng: 127.043353985274,
    },
    {
      title: "강남구2",
      lat: 37.4704803442346,
      lng: 127.049858554755,
    },
    {
      title: "강남구3",
      lat: 37.4739247070036,
      lng: 127.078439959187,
    },
    {
      title: "강남구4",
      lat: 37.4840113681444,
      lng: 127.085143979985,
    },
    {
      title: "강남구5",
      lat: 37.4864527510861,
      lng: 127.09726776455,
    },
    {
      title: "강남구6",
      lat: 37.4747683871255,
      lng: 127.105754096295,
    },
    {
      title: "강남구7",
      lat: 37.4661267411563,
      lng: 127.096337116679,
    },
    {
      title: "강남구8",
      lat: 37.4759173748962,
      lng: 127.110458731341,
    },
    {
      title: "강남구9",
      lat: 37.4655528461652,
      lng: 127.092900035001,
    },
    {
      title: "강남구10",
      lat: 37.470663902143,
      lng: 127.101045626477,
    },
    {
      title: "강남구11",
      lat: 37.5220164822945,
      lng: 127.026414183715,
    },
    {
      title: "강남구12",
      lat: 37.5196382067823,
      lng: 127.024693932736,
    },
    {
      title: "강남구13",
      lat: 37.5235293473713,
      lng: 127.029853720849,
    },
    {
      title: "강남구14",
      lat: 37.5178710951537,
      lng: 127.029670480028,
    },
    {
      title: "강남구15",
      lat: 37.5177982019241,
      lng: 127.032747219181,
    },
    {
      title: "강남구16",
      lat: 37.5149153593012,
      lng: 127.031388614055,
    },
    {
      title: "강남구17",
      lat: 37.5109505480766,
      lng: 127.032834712223,
    },
    {
      title: "강남구18",
      lat: 37.5321427387852,
      lng: 127.030581237746,
    },
    {
      title: "강남구19",
      lat: 37.5229867506998,
      lng: 127.03691246118,
    },
    {
      title: "강남구20",
      lat: 37.512245942959,
      lng: 127.039531278602,
    },
    {
      title: "중구1",
      lat: 37.5556443793207,
      lng: 126.990482095464,
    },
    {
      title: "중구2",
      lat: 37.553120830379,
      lng: 126.983601690131,
    },
    {
      title: "중구3",
      lat: 37.5564360640021,
      lng: 126.980703687451,
    },
    {
      title: "중구4",
      lat: 37.56032909153,
      lng: 126.985773180709,
    },
    {
      title: "중구5",
      lat: 37.5538154062614,
      lng: 126.991155694872,
    },
    {
      title: "중구6",
      lat: 37.5608793438313,
      lng: 127.007090825658,
    },
    {
      title: "중구7",
      lat: 37.5626815430013,
      lng: 127.001295960248,
    },
    {
      title: "중구8",
      lat: 37.5636185107531,
      lng: 126.995772513409,
    },
    {
      title: "서초구1",
      lat: 37.4749145622293,
      lng: 127.007857100963,
    },
    {
      title: "서초구2",
      lat: 37.4773653641414,
      lng: 126.993024475389,
    },
    {
      title: "서초구3",
      lat: 37.4852944013485,
      lng: 126.996641896695,
    },
    {
      title: "서초구4",
      lat: 37.4903397804331,
      lng: 126.991394988254,
    },
    {
      title: "서초구5",
      lat: 37.497259737593,
      lng: 126.995374803502,
    },
    {
      title: "서초구6",
      lat: 37.4600336141905,
      lng: 127.036107243148,
    },
    {
      title: "서초구7",
      lat: 37.4473433948375,
      lng: 127.047311765425,
    },
    {
      title: "서초구8",
      lat: 37.4556862958823,
      lng: 127.081314291898,
    },
    {
      title: "서초구9",
      lat: 37.4473238947344,
      lng: 127.082751771423,
    },
    {
      title: "서초구10",
      lat: 37.4381148712172,
      lng: 127.052368194895,
    },
    {
      title: "영등포구1",
      lat: 37.5254854877886,
      lng: 126.9160476586,
    },
    {
      title: "영등포구2",
      lat: 37.5216703411611,
      lng: 126.923563253669,
    },
    {
      title: "영등포구3",
      lat: 37.5142088594791,
      lng: 126.909177485966,
    },
    {
      title: "영등포구4",
      lat: 37.5318001325465,
      lng: 126.914134212925,
    },
    {
      title: "종로구1",
      lat: 37.569049716855,
      lng: 126.978957247294,
    },
    {
      title: "종로구2",
      lat: 37.5758436331757,
      lng: 126.981423187624,
    },
    {
      title: "종로구3",
      lat: 37.5873043352259,
      lng: 126.981827937423,
    },
    {
      title: "종로구4",
      lat: 37.5912250415967,
      lng: 126.998488412696,
    },
    {
      title: "종로구5",
      lat: 37.5913688435124,
      lng: 126.990698341888,
    },
    {
      title: "종로구6",
      lat: 37.5925916422733,
      lng: 126.973759044182,
    },
    {
      title: "마포구1",
      lat: 37.5655690872777,
      lng: 126.901967305453,
    },
    {
      title: "마포구2",
      lat: 37.5609653765709,
      lng: 126.914015867106,
    },
    {
      title: "마포구3",
      lat: 37.5588733281676,
      lng: 126.911664158239,
    },
    {
      title: "마포구4",
      lat: 37.5519453513449,
      lng: 126.901170343002,
    },
    {
      title: "마포구5",
      lat: 37.5491448251063,
      lng: 126.914753695664,
    },
    {
      title: "마포구6",
      lat: 37.5515990281117,
      lng: 126.919730270907,
    },
    {
      title: "마포구7",
      lat: 37.5547724127038,
      lng: 126.922533540588,
    },
    {
      title: "마포구8",
      lat: 37.547349372171,
      lng: 126.940052902236,
    },
    {
      title: "마포구9",
      lat: 37.5401743126707,
      lng: 126.934220094085,
    },
    {
      title: "마포구10",
      lat: 37.5413319812306,
      lng: 126.942637586044,
    },
    {
      title: "마포구11",
      lat: 37.5472450081021,
      lng: 126.947974251826,
    },
    {
      title: "마포구12",
      lat: 37.5499865950416,
      lng: 126.95412852726,
    },
  ];

  useEffect(() => {
    mapscript();
  }, []);

  const mapscript = () => {
    let container = document.getElementById("map");
    let options = {
      center: new kakao.maps.LatLng(37.52221452144289, 126.98324895254065),
      level: 8,
    };

    //map
    const map = new kakao.maps.Map(container, options);

    positions.forEach(el => {
      // 마커를 생성합니다
      new kakao.maps.Marker({
        //마커가 표시 될 지도
        map: map,
        //마커가 표시 될 위치
        position: new kakao.maps.LatLng(el.lat, el.lng),
        //마커에 hover시 나타날 title
        title: el.title,
      });
    });
  };

  return <div id="map" style={{ width: "100%", height: "100%" }}></div>;
}

export default Map;
